app/controllers/telegram_controller.rb

    def user()
        @user ||= User.find_by(chat_id: from['id'])
---
SELECT "users".* FROM "users" WHERE "users"."chat_id" = ? LIMIT ?  [["chat_id", 1547824270], ["LIMIT", 1]]

    def start!(_word=nil, *_other_words)
      if user() == nil
        user = User.create(user_id: from['id'].to_i, username: username, chat_id: chat['id'].to_i)
---
INSERT INTO "users" ("user_id", "username", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1547824270], ["username", "Omar Shindy"], ["chat_id", 1547824270], ["created_at", "2022-08-20 20:29:36.903050"], ["updated_at", "2022-08-20 20:29:36.903050"]]

    def message(message)
      puts "chat: -------- " + message["photo"][0]["file_id"].to_s
      if message['photo'].to_s != nil
        file_id = message["photo"][0]["file_id"].to_s
        url = "https://api.telegram.org/bot#{token}/getFile?file_id=#{file_id}"
        response = RestClient.get(url)
        response = JSON.parse response.gsub('=>', ":")

        file_path = response["result"]["file_path"].to_s
        url_to_send = "https://api.telegram.org/file/bot#{token}/photos/#{file_path}"

        message = Message.create(
          chat_id: chat['id'],
          type: message['type'],
          media_link: url_to_send,
          users_id: user().id,
          admin: false)
---
INSERT INTO "messages" ("chat_id", "text", "type", "created_at", "updated_at", "users_id", "admin", "media_link") VALUES (?, ?, ?, ?, ?, ?, ?, ?)